IsNameUnique Method (String)
 Determines whether a potential filter element name is unique.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsNameUnique(
	string name
)
Visual Basic
Public Function IsNameUnique ( _
	name As String _
) As Boolean
Visual C++
public:
bool IsNameUnique(
	String^ name
)
Parameters
name
Type: SystemString
 The candidate name.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
FilterElement Class
IsNameUnique Overload
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →